# Company Management System Database
<figure width=100%>
</figure>
    
<hr>

In [ ]:
# Connect to the CSPB MySQL Database
import os
import configparser

mycfg = configparser.ConfigParser()
mycfg.read("mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")
database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url

In [2]:
import os
import configparser

mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("mysql.cfg")    # YOUR CONFIG FILE HERE
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"
os.environ['DATABASE_URL'] = dburl  # define this env. var for sqlmagic

In [3]:
# Load the sql magic 
# Get the MySQL version number to verify we are connected
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.27',)]

In [4]:
# Begin Solution

Drop any existing tables

In [5]:
%sql DROP TABLE IF EXISTS employee, branch, client, works_with, supplier;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.

[]

Create employee table and insert information

In [6]:
%%time
%%sql
DROP TABLE IF EXISTS employee;
DROP TRIGGER IF EXISTS update_employee_count;
CREATE TABLE employee(
    employee_id int PRIMARY KEY, 
    employee_first_name varchar(30), 
    employee_last_name varchar(30), 
    employee_position varchar(30),
    branch_id int,
    manager_id int
);

INSERT INTO employee VALUES(1, "Garett", "Bakhtiari", "Sales", 1, 1);
INSERT INTO employee VALUES(2, "Justin", "Alexander", "Accounting", 2, 2);
INSERT INTO employee VALUES(3, "Bradley", "Williams", "Customer Service", 3, 3);
INSERT INTO employee VALUES(4, "Aaron", "Bosa", "Customer Service", 4, 4);
INSERT INTO employee VALUES(5, "David", "Kittle", "Management", 5, 5);

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
CPU times: user 8.74 ms, sys: 4.34 ms, total: 13.1 ms
Wall time: 87 ms

[]

Check current state of table

In [7]:
%sql SELECT * FROM employee LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
5 rows affected.

[(1, 'Garett', 'Bakhtiari', 'Sales', 1, 1),
 (2, 'Justin', 'Alexander', 'Accounting', 2, 2),
 (3, 'Bradley', 'Williams', 'Customer Service', 3, 3),
 (4, 'Aaron', 'Bosa', 'Customer Service', 4, 4),
 (5, 'David', 'Kittle', 'Management', 5, 5)]

Create branch table and insert information

In [8]:
%%time
%%sql
DROP TABLE IF EXISTS branch;
CREATE TABLE branch(
    branch_id int PRIMARY KEY,
    branch_name varchar(30), 
    branch_location varchar(30),
    employee_count int,
    manager_id int,
    # parent deleted, child set to null
    FOREIGN KEY(manager_id) REFERENCES employee(employee_id) ON DELETE SET NULL
);

INSERT INTO branch VALUES(1, "Denver Branch", "Denver, Colorado", 20, 1);
INSERT INTO branch VALUES(2, "Boulder Branch", "Boulder, Colorado", 12, 2);
INSERT INTO branch VALUES(3, "Dallas Branch", "Dallas, Texas", 25, 3);
INSERT INTO branch VALUES(4, "Fort Collins Branch", "Fort Collins, Colorado", 10, 4);

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
CPU times: user 2.76 ms, sys: 7.65 ms, total: 10.4 ms
Wall time: 83.6 ms

[]

Check current state of table

In [9]:
%sql SELECT * FROM branch LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
4 rows affected.

[(1, 'Denver Branch', 'Denver, Colorado', 20, 1),
 (2, 'Boulder Branch', 'Boulder, Colorado', 12, 2),
 (3, 'Dallas Branch', 'Dallas, Texas', 25, 3),
 (4, 'Fort Collins Branch', 'Fort Collins, Colorado', 10, 4)]

Create client table and insert information

In [10]:
%%time
%%sql
DROP TABLE IF EXISTS client;
CREATE TABLE client(
    client_id int PRIMARY KEY, 
    client_name varchar(30), 
    client_location varchar(30),
    branch_id int,
    # parent deleted, child set to null
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL
);

INSERT INTO client VALUES(1, "Denver Client", "Denver, Colorado", 1);
INSERT INTO client VALUES(2, "Boulder Client", "Boulder, Colorado", 2);
INSERT INTO client VALUES(3, "Dallas Client", "Dallas, Texas", 3);
INSERT INTO client VALUES(4, "Fort Collins Client", "Fort Collins, Colorado", 4);

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
CPU times: user 11.8 ms, sys: 1.5 ms, total: 13.3 ms
Wall time: 94.9 ms

[]

Check current state of table

In [11]:
%sql SELECT * FROM client LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
4 rows affected.

[(1, 'Denver Client', 'Denver, Colorado', 1),
 (2, 'Boulder Client', 'Boulder, Colorado', 2),
 (3, 'Dallas Client', 'Dallas, Texas', 3),
 (4, 'Fort Collins Client', 'Fort Collins, Colorado', 4)]

Create works_with table and insert information

In [12]:
%%time
%%sql
DROP TABLE IF EXISTS works_with;
CREATE TABLE works_with(
    employee_id int, 
    client_id int,
    total_sales int,
    PRIMARY KEY(employee_id, client_id),
    # parent deleted, child deteled through cascading
    FOREIGN KEY(employee_id) REFERENCES employee(employee_id) ON DELETE CASCADE,
    FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE
);

INSERT INTO works_with VALUES(1, 1, 2500);
INSERT INTO works_with VALUES(2, 2, 5000);
INSERT INTO works_with VALUES(3, 3, 10000);
INSERT INTO works_with VALUES(4, 4, 12000);

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
CPU times: user 12.4 ms, sys: 0 ns, total: 12.4 ms
Wall time: 127 ms

[]

Check current state of table

In [13]:
%sql SELECT * FROM works_with LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
4 rows affected.

[(1, 1, 2500), (2, 2, 5000), (3, 3, 10000), (4, 4, 12000)]

Create supplier table and insert information

In [14]:
%%time
%%sql
DROP TABLE IF EXISTS supplier;
CREATE TABLE supplier(
    branch_id int,
    supplier_id int,
    supplier_name varchar(30), 
    supplier_type varchar(30), 
    # parent deleted, child deteled through cascading
    PRIMARY KEY(branch_id, supplier_id),
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE
);

INSERT INTO supplier VALUES(1, 1, "Denver Supplier", "Type 1");
INSERT INTO supplier VALUES(2, 2, "Boulder Supplier", "Type 2");
INSERT INTO supplier VALUES(3, 3, "Dallas Supplier", "Type 3");
INSERT INTO supplier VALUES(4, 4, "Fort Collins Supplier", "Type 4");

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
CPU times: user 8.14 ms, sys: 4.08 ms, total: 12.2 ms
Wall time: 90.5 ms

[]

Check current state of table

In [15]:
%sql SELECT * FROM supplier LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
4 rows affected.

[(1, 1, 'Denver Supplier', 'Type 1'),
 (2, 2, 'Boulder Supplier', 'Type 2'),
 (3, 3, 'Dallas Supplier', 'Type 3'),
 (4, 4, 'Fort Collins Supplier', 'Type 4')]

In [16]:
%%time
%%sql 
SELECT employee_id
FROM employee
LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
5 rows affected.
CPU times: user 3.55 ms, sys: 0 ns, total: 3.55 ms
Wall time: 3.04 ms

[(1,), (2,), (3,), (4,), (5,)]

Create index for employee_id

In [17]:
%%sql
CREATE INDEX IX_employee_id
ON employee(employee_id);

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.

[]

Check current state of index created

In [18]:
%sql SHOW INDEX FROM employee;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
2 rows affected.

[('employee', 0, 'PRIMARY', 1, 'employee_id', 'A', 2, None, None, '', 'BTREE', '', '', 'YES', None),
 ('employee', 1, 'IX_employee_id', 1, 'employee_id', 'A', 2, None, None, '', 'BTREE', '', '', 'YES', None)]

In [19]:
%%time
%%sql 
SELECT employee_id
FROM employee
LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
5 rows affected.
CPU times: user 2.42 ms, sys: 982 µs, total: 3.4 ms
Wall time: 2.39 ms

[(1,), (2,), (3,), (4,), (5,)]

Delete index for employee_id

In [20]:
%%sql
DROP INDEX IX_employee_id
ON employee;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.

[]

Check current state of index deleted

In [21]:
%sql SHOW INDEX FROM employee;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
1 rows affected.

[('employee', 0, 'PRIMARY', 1, 'employee_id', 'A', 2, None, None, '', 'BTREE', '', '', 'YES', None)]

The following finds the branch id and its total number of managers

In [22]:
%%time
%%sql
SELECT employee.branch_id, COUNT(employee.manager_id) as total_managers
FROM employee
WHERE employee.employee_id IN(
    SELECT employee.employee_id
    FROM employee
    JOIN branch
    ON employee.employee_id = branch.branch_id
)
GROUP BY employee.employee_id
ORDER BY COUNT(employee.employee_id) DESC 
LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
4 rows affected.
CPU times: user 3.7 ms, sys: 0 ns, total: 3.7 ms
Wall time: 3.84 ms

[(1, 1), (2, 1), (3, 1), (4, 1)]

The following trigger finds all of the employees in all of the branches

In [23]:
%%time
%%sql
CREATE TRIGGER update_employee_count 
AFTER INSERT ON employee
for each row
begin
    update branch 
    set employee_count = employee_count + 1 
    where branch_id = new.branch_id; 
end;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.
CPU times: user 1.29 ms, sys: 2.98 ms, total: 4.26 ms
Wall time: 24.8 ms

[]

The following inserts a new row in the branch table

In [24]:
%%time
%%sql
INSERT INTO branch VALUES(5, "Phoenix Branch", "Phoenix, Arizona", 23, 5);

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
1 rows affected.
CPU times: user 3.13 ms, sys: 823 µs, total: 3.95 ms
Wall time: 14.1 ms

[]

The following show the total number of employees in each branch

In [25]:
%%time
%%sql
select branch_name, employee_count 
from branch;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
5 rows affected.
CPU times: user 2.77 ms, sys: 524 µs, total: 3.29 ms
Wall time: 2.18 ms

[('Denver Branch', 20),
 ('Boulder Branch', 12),
 ('Dallas Branch', 25),
 ('Fort Collins Branch', 10),
 ('Phoenix Branch', 23)]

The following show all employee names in all branches

In [26]:
%%time
%%sql
SELECT DISTINCT employee_first_name, employee_last_name, branch_name
FROM employee, branch
WHERE employee.branch_id = branch.branch_id
GROUP BY employee_first_name, employee_last_name, branch_name
ORDER BY branch_name
LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
5 rows affected.
CPU times: user 3.12 ms, sys: 0 ns, total: 3.12 ms
Wall time: 3.12 ms

[('Justin', 'Alexander', 'Boulder Branch'),
 ('Bradley', 'Williams', 'Dallas Branch'),
 ('Garett', 'Bakhtiari', 'Denver Branch'),
 ('Aaron', 'Bosa', 'Fort Collins Branch'),
 ('David', 'Kittle', 'Phoenix Branch')]

The following is the list of all distrinct employees, branches, clients, and suppliers, respectively

In [27]:
%%time
%%sql
SELECT DISTINCT employee.employee_first_name, employee.employee_last_name, branch.branch_name, client.client_name, supplier.supplier_name
FROM employee, branch, client, supplier 
WHERE(
    employee.employee_id = branch.branch_id AND
    branch.branch_id = client.client_id AND
    supplier.supplier_id = branch.branch_id
     )
LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
4 rows affected.
CPU times: user 3.37 ms, sys: 0 ns, total: 3.37 ms
Wall time: 3.66 ms

[('Garett', 'Bakhtiari', 'Denver Branch', 'Denver Client', 'Denver Supplier'),
 ('Justin', 'Alexander', 'Boulder Branch', 'Boulder Client', 'Boulder Supplier'),
 ('Bradley', 'Williams', 'Dallas Branch', 'Dallas Client', 'Dallas Supplier'),
 ('Aaron', 'Bosa', 'Fort Collins Branch', 'Fort Collins Client', 'Fort Collins Supplier')]

The following try statement attempts to insert an existing employee from one position/department to another

In [28]:
try:
    result = %sql INSERT INTO employee VALUES(5, "David", "Kittle", "Customer Service", 5, 5);
    print(result)
except Exception as err:
    print("Error! Please check the attributes of your insert statement", err)

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
Error! Please check the attributes of your insert statement (MySQLdb._exceptions.IntegrityError) (1062, "Duplicate entry '5' for key 'employee.PRIMARY'")
[SQL: INSERT INTO employee VALUES(5, "David", "Kittle", "Customer Service", 5, 5);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

The following statement will delete one of the teams

In [29]:
%%time
%%sql
DELETE FROM client 
WHERE client_name = 'Phoenix Client';

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
0 rows affected.
CPU times: user 1.46 ms, sys: 582 µs, total: 2.05 ms
Wall time: 2.04 ms

[]

Check current state of table to verify that the Phoenix Client  doesn't show up anymore

In [30]:
%%time
%%sql
SELECT * 
FROM client
WHERE client_name = 'Dallas Client' or client_name = 'Denver Client' or client_name = 'Phoenix Client'
LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
2 rows affected.
CPU times: user 3.64 ms, sys: 0 ns, total: 3.64 ms
Wall time: 2.62 ms

[(1, 'Denver Client', 'Denver, Colorado', 1),
 (3, 'Dallas Client', 'Dallas, Texas', 3)]

Check current state of table

In [31]:
%%time
%%sql
SELECT * 
FROM employee, branch, client, supplier 
LIMIT 5;

 * mysql://rara6918:***@applied-sql.cs.colorado.edu:3306/rara6918
5 rows affected.
CPU times: user 4.22 ms, sys: 43 µs, total: 4.27 ms
Wall time: 3.32 ms

[(5, 'David', 'Kittle', 'Management', 5, 5, 1, 'Denver Branch', 'Denver, Colorado', 20, 1, 1, 'Denver Client', 'Denver, Colorado', 1, 4, 4, 'Fort Collins Supplier', 'Type 4'),
 (4, 'Aaron', 'Bosa', 'Customer Service', 4, 4, 1, 'Denver Branch', 'Denver, Colorado', 20, 1, 1, 'Denver Client', 'Denver, Colorado', 1, 4, 4, 'Fort Collins Supplier', 'Type 4'),
 (3, 'Bradley', 'Williams', 'Customer Service', 3, 3, 1, 'Denver Branch', 'Denver, Colorado', 20, 1, 1, 'Denver Client', 'Denver, Colorado', 1, 4, 4, 'Fort Collins Supplier', 'Type 4'),
 (2, 'Justin', 'Alexander', 'Accounting', 2, 2, 1, 'Denver Branch', 'Denver, Colorado', 20, 1, 1, 'Denver Client', 'Denver, Colorado', 1, 4, 4, 'Fort Collins Supplier', 'Type 4'),
 (1, 'Garett', 'Bakhtiari', 'Sales', 1, 1, 1, 'Denver Branch', 'Denver, Colorado', 20, 1, 1, 'Denver Client', 'Denver, Colorado', 1, 4, 4, 'Fort Collins Supplier', 'Type 4')]